Tekla.Structures.ModelInternal.SharingLocation
Implements Tekla.Structures.Model.ISharingLocation.

Tekla.Structures.ModelInternal.SharingLocation.#ctor(System.Guid,System.String,System.String)
Initializes a new instance of the Tekla.Structures.ModelInternal.SharingLocation class.
id: The unique identifier.
name: The name.
displayName: The display name.

Tekla.Structures.ModelInternal.SharingLocation.Id


Tekla.Structures.ModelInternal.SharingLocation.Name


Tekla.Structures.ModelInternal.SharingLocation.DisplayName
